#include <stdio.h>
#include <locale.h>
void main(void) {
	setlocale(LC_ALL, "RUS");
	printf("%20s \n ", "Это текст");
	printf("%s \n\t", "Это текст");
	printf("%10.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	printf("Остаток от деления %f на %d равен %f\n ", 7., 5, 7. / 5);
	printf("Остаток от деления %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %f\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %f\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %f\n ", 5., 2., 5. / 2);
}